In [1]:
import numpy as np

In [2]:
import pandas as pd

*INDEXING OPTIONS IN DATAFRAME*

In [3]:
df=pd.DataFrame(np.arange(9).reshape(3,3),index=['Ohio','India','California'],columns=['one','two','three'])

In [4]:
df

            one  two  three
Ohio          0    1      2
India         3    4      5
California    6    7      8

In [14]:
df[['one']]                       #this method only selects coulumn

            one
Ohio          0
India         3
California    6

In [6]:
df[['one','two']]               #this method only selects coulumns

            one  two
Ohio          0    1
India         3    4
California    6    7

In [7]:
df.loc[['Ohio']]                        #rows,columns

      one  two  three
Ohio    0    1      2

In [8]:
df.loc['Ohio':'India']                #unlike lists, in loc label slicing, end label is inclusive.
                                      #when using colon : , forget the brackets :)

       one  two  three
Ohio     0    1      2
India    3    4      5

In [9]:
df.loc['Ohio':'India',['one']]        #rows,columns

       one
Ohio     0
India    3

In [10]:
df.loc[:,['one']]

            one
Ohio          0
India         3
California    6

In [11]:
#Repeat the same stuff same above by giving integer as indices for iloc to work
df.iloc[0]

one      0
two      1
three    2
Name: Ohio, dtype: int32

In [12]:
df.iloc[[1,2],[1,2]]      #unlike loc slicing,iloc slicing works same as list slicing

            two  three
India         4      5
California    7      8

In [15]:
df.iloc[:,[1,2]]

            two  three
Ohio          1      2
India         4      5
California    7      8